posts/sicp-31-naznacheniia-i-lokalnoye-sostoianiia.org
#+BEGIN_COMMENT
.. title: SICP 3.1 Назначения и локальноые состояния.
.. slug: sicp-31-naznacheniia-i-lokalnoye-sostoianiia
.. date: 2020-02-02 11:46:58 UTC+03:00
.. tags: sicp, scheme, assignment, local_state
.. category: 
.. link: 
.. description: 
.. type: text

#+END_COMMENT

* Упражнение 3.1

определите сумматор

#+BEGIN_SRC scheme
(define A (make-accumulator 5))
(A 10)
15
(A 10)
25
#+END_SRC

#+BEGIN_SRC scheme
(define (make-accumulator sum)
  (lambda (x) (begin
           (set! sum (+ sum x))
           sum
           )))
#+END_SRC

* Упражнение 3.2

в программах для тестирования важно уметь считать количество вызовов функции. Напишите процедуру, которая считает количество вызовов например функции sqrt.

#+BEGIN_SRC scheme
(define s (make-monitored sqrt))

(s 100)
10

(s 'how-many-calls?)
1
#+END_SRC

#+BEGIN_SRC scheme
(define (make-monitor f)
  (define how-many-call? 0)
  (define (incretement)
    (begin
      (set! how-many-call? (+ how-many-call? 1))
      f))
  (define (dispatch m)
    (cond ((eq? m 'how-many-call?) how-many-call?)
          (else ((incretement) m))))
  dispatch)

(define s (make-monitor sqrt))
(s 100)
(s 'how-many-call?)
#+END_SRC


* Упражнение 3.3

Измените процедуру make-account, чтобы она принимала пароль в конструкторе. И пощволяла списание только при передаче его в параметре.

#+BEGIN_SRC scheme
(define acc (make-account 100 'secret-password))
((acc 'secret-password 'withdraw) 40)
60

((acc 'some-other-password 'deposit) 50)
"Incorrect password"
#+END_SRC

#+BEGIN_SRC scheme
(define (make-account balance password)
  (define (withdraw amount)
    (if (>= balance amount)
        (begin (set! balance (- balance amount))
               balance)
        "Insufficient funds"))
  (define (deposit amount)
    (set! balance (+ balance amount))
    balance)

  (define (permission-denied . m)
    (display "Incorrect password"))

  (define (dispatch pass func)
    (cond ((not (eq? pass password)) permission-denied)
          ((eq? func 'withdraw) withdraw)
          ((eq? func 'deposit) deposit)
          (else (error "Unknown request -- MAKE-ACCOUNT"
                       func))))
  dispatch)

(define acc (make-account 100 'secret-password))
acc
((acc 'secret-password 'withdraw) 40)
((acc 'some-other-password 'deposit) 50)
#+END_SRC

