posts/sicp-31-naznacheniia-i-lokalnoye-sostoianiia/index.html
<!DOCTYPE html>
<html prefix="
        og: http://ogp.me/ns# article: http://ogp.me/ns/article#
    " vocab="http://ogp.me/ns" lang="ru">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width">
<title>SICP 3.1 Назначения и локальноые состояния. | VelikiiNehochuha Blog</title>
<link href="../../assets/css/all-nocdn.css" rel="stylesheet" type="text/css">
<meta name="theme-color" content="#5670d4">
<meta name="generator" content="Nikola (getnikola.com)">
<link rel="alternate" type="application/rss+xml" title="RSS" hreflang="ru" href="../../rss.xml">
<link rel="canonical" href="http://velikiinehochuha.github.io/posts/sicp-31-naznacheniia-i-lokalnoye-sostoianiia/">
<!--[if lt IE 9]><![endif]--><meta name="author" content="Velikii Nehochuha">
<link rel="prev" href="../sicp-25-sistemy-s-obshchimi-operatsiiami/" title="SICP 2.5 Системы с общими операциями." type="text/html">
<link rel="next" href="../sicp-32-model-vychislenii-s-okruzheniiami/" title="SICP 3.2 Модель вычислений с окружениями" type="text/html">
<meta property="og:site_name" content="VelikiiNehochuha Blog">
<meta property="og:title" content="SICP 3.1 Назначения и локальноые состояния.">
<meta property="og:url" content="http://velikiinehochuha.github.io/posts/sicp-31-naznacheniia-i-lokalnoye-sostoianiia/">
<meta property="og:description" content="Упражнение 3.1


определите сумматор


(define A (make-accumulator 5))
(A 10)
15
(A 10)
25


(define (make-accumulator sum)
  (lambda (x) (begin
	   (set! sum (+ sum x))
	   sum
	   )))





Упражнени">
<meta property="og:type" content="article">
<meta property="article:published_time" content="2020-02-02T11:46:58+03:00">
<meta property="article:tag" content="assignment">
<meta property="article:tag" content="local_state">
<meta property="article:tag" content="scheme">
<meta property="article:tag" content="sicp">
</head>
<body>
    <a href="#content" class="sr-only sr-only-focusable">Перейти к главному содержимому</a>
    <div id="container">
            <header id="header"><h1 id="brand"><a href="../../" title="VelikiiNehochuha Blog" rel="home">

        <span id="blog-title">VelikiiNehochuha Blog</span>
    </a></h1>

        
            <nav id="menu"><ul>
<li><a href="../../archive.html">Архив</a></li>
                <li><a href="../../categories/">Тэги</a></li>
                <li><a href="../../rss.xml">RSS лента</a></li>

    
    
    
    </ul></nav></header><main id="content"><article class="post-text h-entry hentry postpage" itemscope="itemscope" itemtype="http://schema.org/Article"><header><h1 class="p-name entry-title" itemprop="headline name"><a href="." class="u-url">SICP 3.1 Назначения и локальноые состояния.</a></h1>

        <div class="metadata">
            <p class="byline author vcard p-author h-card"><span class="byline-name fn p-name" itemprop="author">
                    Velikii Nehochuha
            </span></p>
            <p class="dateline">
            <a href="." rel="bookmark">
            <time class="published dt-published" datetime="2020-02-02T11:46:58+03:00" itemprop="datePublished" title="2020-02-02 11:46">2020-02-02 11:46</time></a>
            </p>
                    <p class="sourceline"><a href="index.org" class="sourcelink">Источник</a></p>

        </div>
        
    </header><div class="e-content entry-content" itemprop="articleBody text">
    <div id="outline-container-org21ec93b" class="outline-2">
<h2 id="org21ec93b">Упражнение 3.1</h2>
<div class="outline-text-2" id="text-org21ec93b">
<p>
определите сумматор
</p>

<div class="highlight"><pre><span></span><span class="p">(</span><span class="k">define </span><span class="nv">A</span> <span class="p">(</span><span class="nf">make-accumulator</span> <span class="mi">5</span><span class="p">))</span>
<span class="p">(</span><span class="nf">A</span> <span class="mi">10</span><span class="p">)</span>
<span class="mi">15</span>
<span class="p">(</span><span class="nf">A</span> <span class="mi">10</span><span class="p">)</span>
<span class="mi">25</span>
</pre></div>

<div class="highlight"><pre><span></span><span class="p">(</span><span class="k">define </span><span class="p">(</span><span class="nf">make-accumulator</span> <span class="nv">sum</span><span class="p">)</span>
  <span class="p">(</span><span class="k">lambda </span><span class="p">(</span><span class="nf">x</span><span class="p">)</span> <span class="p">(</span><span class="nf">begin</span>
	   <span class="p">(</span><span class="k">set! </span><span class="nv">sum</span> <span class="p">(</span><span class="nb">+ </span><span class="nv">sum</span> <span class="nv">x</span><span class="p">))</span>
	   <span class="nv">sum</span>
	   <span class="p">)))</span>
</pre></div>
</div>
</div>

<div id="outline-container-orgeaa3e75" class="outline-2">
<h2 id="orgeaa3e75">Упражнение 3.2</h2>
<div class="outline-text-2" id="text-orgeaa3e75">
<p>
в программах для тестирования важно уметь считать количество вызовов функции. Напишите процедуру, которая считает количество вызовов например функции sqrt.
</p>

<div class="highlight"><pre><span></span><span class="p">(</span><span class="k">define </span><span class="nv">s</span> <span class="p">(</span><span class="nf">make-monitored</span> <span class="nv">sqrt</span><span class="p">))</span>

<span class="p">(</span><span class="nf">s</span> <span class="mi">100</span><span class="p">)</span>
<span class="mi">10</span>

<span class="p">(</span><span class="nf">s</span> <span class="ss">'how-many-calls?</span><span class="p">)</span>
<span class="mi">1</span>
</pre></div>

<div class="highlight"><pre><span></span><span class="p">(</span><span class="k">define </span><span class="p">(</span><span class="nf">make-monitor</span> <span class="nv">f</span><span class="p">)</span>
  <span class="p">(</span><span class="k">define </span><span class="nv">how-many-call?</span> <span class="mi">0</span><span class="p">)</span>
  <span class="p">(</span><span class="k">define </span><span class="p">(</span><span class="nf">incretement</span><span class="p">)</span>
    <span class="p">(</span><span class="nf">begin</span>
      <span class="p">(</span><span class="k">set! </span><span class="nv">how-many-call?</span> <span class="p">(</span><span class="nb">+ </span><span class="nv">how-many-call?</span> <span class="mi">1</span><span class="p">))</span>
      <span class="nv">f</span><span class="p">))</span>
  <span class="p">(</span><span class="k">define </span><span class="p">(</span><span class="nf">dispatch</span> <span class="nv">m</span><span class="p">)</span>
    <span class="p">(</span><span class="k">cond </span><span class="p">((</span><span class="nb">eq? </span><span class="nv">m</span> <span class="ss">'how-many-call?</span><span class="p">)</span> <span class="nv">how-many-call?</span><span class="p">)</span>
	  <span class="p">(</span><span class="k">else </span><span class="p">((</span><span class="nf">incretement</span><span class="p">)</span> <span class="nv">m</span><span class="p">))))</span>
  <span class="nv">dispatch</span><span class="p">)</span>

<span class="p">(</span><span class="k">define </span><span class="nv">s</span> <span class="p">(</span><span class="nf">make-monitor</span> <span class="nv">sqrt</span><span class="p">))</span>
<span class="p">(</span><span class="nf">s</span> <span class="mi">100</span><span class="p">)</span>
<span class="p">(</span><span class="nf">s</span> <span class="ss">'how-many-call?</span><span class="p">)</span>
</pre></div>
</div>
</div>


<div id="outline-container-org6812731" class="outline-2">
<h2 id="org6812731">Упражнение 3.3</h2>
<div class="outline-text-2" id="text-org6812731">
<p>
Измените процедуру make-account, чтобы она принимала пароль в конструкторе. И пощволяла списание только при передаче его в параметре.
</p>

<div class="highlight"><pre><span></span><span class="p">(</span><span class="k">define </span><span class="nv">acc</span> <span class="p">(</span><span class="nf">make-account</span> <span class="mi">100</span> <span class="ss">'secret-password</span><span class="p">))</span>
<span class="p">((</span><span class="nf">acc</span> <span class="ss">'secret-password</span> <span class="ss">'withdraw</span><span class="p">)</span> <span class="mi">40</span><span class="p">)</span>
<span class="mi">60</span>

<span class="p">((</span><span class="nf">acc</span> <span class="ss">'some-other-password</span> <span class="ss">'deposit</span><span class="p">)</span> <span class="mi">50</span><span class="p">)</span>
<span class="s">"Incorrect password"</span>
</pre></div>

<div class="highlight"><pre><span></span><span class="p">(</span><span class="k">define </span><span class="p">(</span><span class="nf">make-account</span> <span class="nv">balance</span> <span class="nv">password</span><span class="p">)</span>
  <span class="p">(</span><span class="k">define </span><span class="p">(</span><span class="nf">withdraw</span> <span class="nv">amount</span><span class="p">)</span>
    <span class="p">(</span><span class="k">if </span><span class="p">(</span><span class="nb">&gt;= </span><span class="nv">balance</span> <span class="nv">amount</span><span class="p">)</span>
	<span class="p">(</span><span class="k">begin </span><span class="p">(</span><span class="k">set! </span><span class="nv">balance</span> <span class="p">(</span><span class="nb">- </span><span class="nv">balance</span> <span class="nv">amount</span><span class="p">))</span>
	       <span class="nv">balance</span><span class="p">)</span>
	<span class="s">"Insufficient funds"</span><span class="p">))</span>
  <span class="p">(</span><span class="k">define </span><span class="p">(</span><span class="nf">deposit</span> <span class="nv">amount</span><span class="p">)</span>
    <span class="p">(</span><span class="k">set! </span><span class="nv">balance</span> <span class="p">(</span><span class="nb">+ </span><span class="nv">balance</span> <span class="nv">amount</span><span class="p">))</span>
    <span class="nv">balance</span><span class="p">)</span>

  <span class="p">(</span><span class="k">define </span><span class="p">(</span><span class="nf">permission-denied</span> <span class="o">.</span> <span class="nv">m</span><span class="p">)</span>
    <span class="p">(</span><span class="nb">display </span><span class="s">"Incorrect password"</span><span class="p">))</span>

  <span class="p">(</span><span class="k">define </span><span class="p">(</span><span class="nf">dispatch</span> <span class="nv">pass</span> <span class="nv">func</span><span class="p">)</span>
    <span class="p">(</span><span class="k">cond </span><span class="p">((</span><span class="nb">not </span><span class="p">(</span><span class="nb">eq? </span><span class="nv">pass</span> <span class="nv">password</span><span class="p">))</span> <span class="nv">permission-denied</span><span class="p">)</span>
	  <span class="p">((</span><span class="nb">eq? </span><span class="nv">func</span> <span class="ss">'withdraw</span><span class="p">)</span> <span class="nv">withdraw</span><span class="p">)</span>
	  <span class="p">((</span><span class="nb">eq? </span><span class="nv">func</span> <span class="ss">'deposit</span><span class="p">)</span> <span class="nv">deposit</span><span class="p">)</span>
	  <span class="p">(</span><span class="k">else </span><span class="p">(</span><span class="nf">error</span> <span class="s">"Unknown request -- MAKE-ACCOUNT"</span>
		       <span class="nv">func</span><span class="p">))))</span>
  <span class="nv">dispatch</span><span class="p">)</span>

<span class="p">(</span><span class="k">define </span><span class="nv">acc</span> <span class="p">(</span><span class="nf">make-account</span> <span class="mi">100</span> <span class="ss">'secret-password</span><span class="p">))</span>
<span class="nv">acc</span>
<span class="p">((</span><span class="nf">acc</span> <span class="ss">'secret-password</span> <span class="ss">'withdraw</span><span class="p">)</span> <span class="mi">40</span><span class="p">)</span>
<span class="p">((</span><span class="nf">acc</span> <span class="ss">'some-other-password</span> <span class="ss">'deposit</span><span class="p">)</span> <span class="mi">50</span><span class="p">)</span>
</pre></div>
</div>
</div>
