posts/sicp-31-naznacheniia-i-lokalnoye-sostoianiia.org
* Упражнение 3.4

Измените процедуру make-account, что бы при 7 вызовах с неверным паролем возвращалась процедура call-the-cops.

#+BEGIN_SRC scheme
(define (make-account balance password)
  (define (withdraw amount)
    (if (>= balance amount)
        (begin (set! balance (- balance amount))
               balance)
        "Insufficient funds"))
  (define (deposit amount)
    (set! balance (+ balance amount))
    balance)

  (define (permission-denied . m)
    (display "Incorrect password"))


  (define monitor-error-password (make-monitor permission-denied))
  (define (call-limit?)
    (when (= (monitor-error-password 'how-many-call?) 2)
        (display "Viu viu viu viu..")))

  (define (dispatch pass func)
    (cond ((not (eq? pass password)) (begin
                                       (call-limit?)
                                       monitor-error-password))
          ((eq? func 'withdraw) withdraw)
          ((eq? func 'deposit) deposit)
          (else (error "Unknown request -- MAKE-ACCOUNT"
                       func))))
  dispatch)

(define acc (make-account 100 'secret-password))
acc
((acc 'secret-password 'withdraw) 40)
((acc 'some-other-password 'deposit) 50)
#+END_SRC

* Упражнение 3.5

Реализуйте интегрирование методом Монте-Карло в виде процедуры estimateintegral, которая в качестве аргументов принимает предикат P, верхнюю и нижнюю границы прямоугольника x1, x2, y1 и y2, а также число проверок, которые мы должны осуществить, чтобы оценить отношение площадей. Ваша процедура должна использовать ту же самую процедуру monte-carlo, которая выше использовалась для оценки значения π. Оцените π при помощи estimate-integral.


#+BEGIN_SRC scheme
;; окружность
(define (predicate x y)
  (<= (+ (square (- x 5)) (square (- y 7))) (square 3)))

;; x от 2 до 8
;; y от 4 до 10
(define (random-in-range low high)
  (let ((range (- high low)))
    (+ low (random range))))

(define (estimateintegral P min-x max-x min-y max-y trials)
  (define (test)
    (P
     (random-in-range min-x max-x)
     (random-in-range min-y max-y)))

  (* (monte-carlo trials test) (* (- max-x min-x) (- max-y min-y))))

(estimateintegral predicate 2 8 4 10 100000)
#+END_SRC

результат получился равен 26.97948, π = 2.99. Что бы получить лучшие значения нужно брать сетку с меньшим интервалом. Или например оценивать на окружности с большим радиусом.

#+BEGIN_SRC scheme
(define (predicate x y)
  (<= (+ (square (- x 25)) (square (- y 25))) (square 25)))
(estimateintegral predicate 0 50 0 50 100000)
;; 113/4
;; 3.1388
#+END_SRC


