posts/sicp-31-naznacheniia-i-lokalnoye-sostoianiia/index.html

<div id="outline-container-org432f6bd" class="outline-2">
<h2 id="org432f6bd">Упражнение 3.4</h2>
<div class="outline-text-2" id="text-org432f6bd">
<p>
Измените процедуру make-account, что бы при 7 вызовах с неверным паролем возвращалась процедура call-the-cops.
</p>

<div class="highlight"><pre><span></span><span class="p">(</span><span class="k">define </span><span class="p">(</span><span class="nf">make-account</span> <span class="nv">balance</span> <span class="nv">password</span><span class="p">)</span>
  <span class="p">(</span><span class="k">define </span><span class="p">(</span><span class="nf">withdraw</span> <span class="nv">amount</span><span class="p">)</span>
    <span class="p">(</span><span class="k">if </span><span class="p">(</span><span class="nb">&gt;= </span><span class="nv">balance</span> <span class="nv">amount</span><span class="p">)</span>
	<span class="p">(</span><span class="k">begin </span><span class="p">(</span><span class="k">set! </span><span class="nv">balance</span> <span class="p">(</span><span class="nb">- </span><span class="nv">balance</span> <span class="nv">amount</span><span class="p">))</span>
	       <span class="nv">balance</span><span class="p">)</span>
	<span class="s">"Insufficient funds"</span><span class="p">))</span>
  <span class="p">(</span><span class="k">define </span><span class="p">(</span><span class="nf">deposit</span> <span class="nv">amount</span><span class="p">)</span>
    <span class="p">(</span><span class="k">set! </span><span class="nv">balance</span> <span class="p">(</span><span class="nb">+ </span><span class="nv">balance</span> <span class="nv">amount</span><span class="p">))</span>
    <span class="nv">balance</span><span class="p">)</span>

  <span class="p">(</span><span class="k">define </span><span class="p">(</span><span class="nf">permission-denied</span> <span class="o">.</span> <span class="nv">m</span><span class="p">)</span>
    <span class="p">(</span><span class="nb">display </span><span class="s">"Incorrect password"</span><span class="p">))</span>


  <span class="p">(</span><span class="k">define </span><span class="nv">monitor-error-password</span> <span class="p">(</span><span class="nf">make-monitor</span> <span class="nv">permission-denied</span><span class="p">))</span>
  <span class="p">(</span><span class="k">define </span><span class="p">(</span><span class="nf">call-limit?</span><span class="p">)</span>
    <span class="p">(</span><span class="nf">when</span> <span class="p">(</span><span class="nb">= </span><span class="p">(</span><span class="nf">monitor-error-password</span> <span class="ss">'how-many-call?</span><span class="p">)</span> <span class="mi">2</span><span class="p">)</span>
	<span class="p">(</span><span class="nb">display </span><span class="s">"Viu viu viu viu.."</span><span class="p">)))</span>

  <span class="p">(</span><span class="k">define </span><span class="p">(</span><span class="nf">dispatch</span> <span class="nv">pass</span> <span class="nv">func</span><span class="p">)</span>
    <span class="p">(</span><span class="k">cond </span><span class="p">((</span><span class="nb">not </span><span class="p">(</span><span class="nb">eq? </span><span class="nv">pass</span> <span class="nv">password</span><span class="p">))</span> <span class="p">(</span><span class="nf">begin</span>
				       <span class="p">(</span><span class="nf">call-limit?</span><span class="p">)</span>
				       <span class="nv">monitor-error-password</span><span class="p">))</span>
	  <span class="p">((</span><span class="nb">eq? </span><span class="nv">func</span> <span class="ss">'withdraw</span><span class="p">)</span> <span class="nv">withdraw</span><span class="p">)</span>
	  <span class="p">((</span><span class="nb">eq? </span><span class="nv">func</span> <span class="ss">'deposit</span><span class="p">)</span> <span class="nv">deposit</span><span class="p">)</span>
	  <span class="p">(</span><span class="k">else </span><span class="p">(</span><span class="nf">error</span> <span class="s">"Unknown request -- MAKE-ACCOUNT"</span>
		       <span class="nv">func</span><span class="p">))))</span>
  <span class="nv">dispatch</span><span class="p">)</span>

<span class="p">(</span><span class="k">define </span><span class="nv">acc</span> <span class="p">(</span><span class="nf">make-account</span> <span class="mi">100</span> <span class="ss">'secret-password</span><span class="p">))</span>
<span class="nv">acc</span>
<span class="p">((</span><span class="nf">acc</span> <span class="ss">'secret-password</span> <span class="ss">'withdraw</span><span class="p">)</span> <span class="mi">40</span><span class="p">)</span>
<span class="p">((</span><span class="nf">acc</span> <span class="ss">'some-other-password</span> <span class="ss">'deposit</span><span class="p">)</span> <span class="mi">50</span><span class="p">)</span>
</pre></div>
</div>
</div>

<div id="outline-container-org5b5c5e4" class="outline-2">
<h2 id="org5b5c5e4">Упражнение 3.5</h2>
<div class="outline-text-2" id="text-org5b5c5e4">
<p>
Реализуйте интегрирование методом Монте-Карло в виде процедуры estimateintegral, которая в качестве аргументов принимает предикат P, верхнюю и нижнюю границы прямоугольника x1, x2, y1 и y2, а также число проверок, которые мы должны осуществить, чтобы оценить отношение площадей. Ваша процедура должна использовать ту же самую процедуру monte-carlo, которая выше использовалась для оценки значения π. Оцените π при помощи estimate-integral.
</p>


<div class="highlight"><pre><span></span><span class="c1">;; окружность</span>
<span class="p">(</span><span class="k">define </span><span class="p">(</span><span class="nf">predicate</span> <span class="nv">x</span> <span class="nv">y</span><span class="p">)</span>
  <span class="p">(</span><span class="nb">&lt;= </span><span class="p">(</span><span class="nb">+ </span><span class="p">(</span><span class="nf">square</span> <span class="p">(</span><span class="nb">- </span><span class="nv">x</span> <span class="mi">5</span><span class="p">))</span> <span class="p">(</span><span class="nf">square</span> <span class="p">(</span><span class="nb">- </span><span class="nv">y</span> <span class="mi">7</span><span class="p">)))</span> <span class="p">(</span><span class="nf">square</span> <span class="mi">3</span><span class="p">)))</span>

<span class="c1">;; x от 2 до 8</span>
<span class="c1">;; y от 4 до 10</span>
<span class="p">(</span><span class="k">define </span><span class="p">(</span><span class="nf">random-in-range</span> <span class="nv">low</span> <span class="nv">high</span><span class="p">)</span>
  <span class="p">(</span><span class="k">let </span><span class="p">((</span><span class="nf">range</span> <span class="p">(</span><span class="nb">- </span><span class="nv">high</span> <span class="nv">low</span><span class="p">)))</span>
    <span class="p">(</span><span class="nb">+ </span><span class="nv">low</span> <span class="p">(</span><span class="nf">random</span> <span class="nv">range</span><span class="p">))))</span>

<span class="p">(</span><span class="k">define </span><span class="p">(</span><span class="nf">estimateintegral</span> <span class="nv">P</span> <span class="nv">min-x</span> <span class="nv">max-x</span> <span class="nv">min-y</span> <span class="nv">max-y</span> <span class="nv">trials</span><span class="p">)</span>
  <span class="p">(</span><span class="k">define </span><span class="p">(</span><span class="nf">test</span><span class="p">)</span>
    <span class="p">(</span><span class="nf">P</span>
     <span class="p">(</span><span class="nf">random-in-range</span> <span class="nv">min-x</span> <span class="nv">max-x</span><span class="p">)</span>
     <span class="p">(</span><span class="nf">random-in-range</span> <span class="nv">min-y</span> <span class="nv">max-y</span><span class="p">)))</span>

  <span class="p">(</span><span class="nb">* </span><span class="p">(</span><span class="nf">monte-carlo</span> <span class="nv">trials</span> <span class="nv">test</span><span class="p">)</span> <span class="p">(</span><span class="nb">* </span><span class="p">(</span><span class="nb">- </span><span class="nv">max-x</span> <span class="nv">min-x</span><span class="p">)</span> <span class="p">(</span><span class="nb">- </span><span class="nv">max-y</span> <span class="nv">min-y</span><span class="p">))))</span>

<span class="p">(</span><span class="nf">estimateintegral</span> <span class="nv">predicate</span> <span class="mi">2</span> <span class="mi">8</span> <span class="mi">4</span> <span class="mi">10</span> <span class="mi">100000</span><span class="p">)</span>
</pre></div>

<p>
результат получился равен 26.97948, π = 2.99. Что бы получить лучшие значения нужно брать сетку с меньшим интервалом. Или например оценивать на окружности с большим радиусом.
</p>

<div class="highlight"><pre><span></span><span class="p">(</span><span class="k">define </span><span class="p">(</span><span class="nf">predicate</span> <span class="nv">x</span> <span class="nv">y</span><span class="p">)</span>
  <span class="p">(</span><span class="nb">&lt;= </span><span class="p">(</span><span class="nb">+ </span><span class="p">(</span><span class="nf">square</span> <span class="p">(</span><span class="nb">- </span><span class="nv">x</span> <span class="mi">25</span><span class="p">))</span> <span class="p">(</span><span class="nf">square</span> <span class="p">(</span><span class="nb">- </span><span class="nv">y</span> <span class="mi">25</span><span class="p">)))</span> <span class="p">(</span><span class="nf">square</span> <span class="mi">25</span><span class="p">)))</span>
<span class="p">(</span><span class="nf">estimateintegral</span> <span class="nv">predicate</span> <span class="mi">0</span> <span class="mi">50</span> <span class="mi">0</span> <span class="mi">50</span> <span class="mi">100000</span><span class="p">)</span>
<span class="c1">;; 113/4</span>
<span class="c1">;; 3.1388</span>
</pre></div>
</div>
</div>
