posts/sicp-31-naznacheniia-i-lokalnoye-sostoianiia.org
* Упражнение 3.6

Полезно иметь возможность сбросить генератор случайных чисел, чтобы получить последовательность, которая начинается с некоторого числа. Постройте новую процедуру rand, которая вызывается с аргументом. Этот аргумент должен быть либо символом generate, либо символом reset. Процедура работает так: (rand 'generate) порождает новое случайное число; ((rand 'reset) (новое-значение)) сбрасывает внутреннюю переменную состояния в указанное новое значение. Таким образом, сбрасывая значения, можно получать повторяющиеся последовательности. Эта возможность очень полезна при тестировании и отладке программ, использующих случайные числа.


#+BEGIN_SRC scheme
(define rand
  (let ((random-init 2))
    (define (rand-update)
      (cond ((= random-init 0) 7)
            ((= random-init 2) 5)
            ((= random-init 5) 8)
            ((= random-init 8) 3)
            ((= random-init 3) 9)
            ((= random-init 9) 1)
            ((= random-init 1) 4)
            ((= random-init 4) 6)
            ((= random-init 6) 0)
            ((= random-init 7) 2)
            ))

    (define (generate)
      (set! random-init (rand-update))
      random-init)

    (lambda (m)
      (cond ((eq? m 'reset) (lambda (x)
                              (begin (set! random-init x)
                                     x)))
            ((eq? m 'generate) (generate))))
    ))

((rand 'reset) 8)
(rand 'generate)
#+END_SRC


* Упражнение 3.7

Нужно написать процедуру связанного аккаунта, что бы как новый так и старый пользователи могли с ним работать.

#+BEGIN_SRC scheme
(define peter-acc (make-account 100 'secret))
peter-acc
((peter-acc 'secret 'withdraw) 10)
((peter-acc 'some-other-password 'deposit) 50)
((peter-acc 'secret 'deposit) 50)


(define (make-joint account acc-pass new-pass)
  (display ((account acc-pass 'withdraw) 0))
  (when (equal? ((account acc-pass 'withdraw) 0) "Incorrect password")
    (error "Incorrect password"))

  (define (permission-denied . m)
    "Incorrect password")
  (define monitor-error-password (make-monitor permission-denied))
  (define (call-limit?)
    (when (= (monitor-error-password 'how-many-call?) 7)
        (display "Viu viu viu viu..")))

  (define (withdraw amount)
    ((account acc-pass 'withdraw) amount))

  (define (deposit amount)
    ((account acc-pass 'deposit) amount))

  (define (dispatch pass func)
    (cond ((not (eq? pass new-pass)) (begin
                                       (call-limit?)
                                       monitor-error-password))
          ((eq? func 'withdraw) withdraw)
          ((eq? func 'deposit) deposit)
          (else (error "Unknown request -- MAKE-ACCOUNT"
                       func))))
  dispatch
  )


(define paul-acc
  (make-joint peter-acc 'secret 'open-sesam))
((paul-acc 'open-sesam 'withdraw) 10)
#+END_SRC


