posts/sicp-31-naznacheniia-i-lokalnoye-sostoianiia/index.html


<div id="outline-container-org685973c" class="outline-2">
<h2 id="org685973c">Упражнение 3.6</h2>
<div class="outline-text-2" id="text-org685973c">
<p>
Полезно иметь возможность сбросить генератор случайных чисел, чтобы получить последовательность, которая начинается с некоторого числа. Постройте новую процедуру rand, которая вызывается с аргументом. Этот аргумент должен быть либо символом generate, либо символом reset. Процедура работает так: (rand 'generate) порождает новое случайное число; ((rand 'reset) (новое-значение)) сбрасывает внутреннюю переменную состояния в указанное новое значение. Таким образом, сбрасывая значения, можно получать повторяющиеся последовательности. Эта возможность очень полезна при тестировании и отладке программ, использующих случайные числа.
</p>


<div class="highlight"><pre><span></span><span class="p">(</span><span class="k">define </span><span class="nv">rand</span>
  <span class="p">(</span><span class="k">let </span><span class="p">((</span><span class="nf">random-init</span> <span class="mi">2</span><span class="p">))</span>
    <span class="p">(</span><span class="k">define </span><span class="p">(</span><span class="nf">rand-update</span><span class="p">)</span>
      <span class="p">(</span><span class="k">cond </span><span class="p">((</span><span class="nb">= </span><span class="nv">random-init</span> <span class="mi">0</span><span class="p">)</span> <span class="mi">7</span><span class="p">)</span>
	    <span class="p">((</span><span class="nb">= </span><span class="nv">random-init</span> <span class="mi">2</span><span class="p">)</span> <span class="mi">5</span><span class="p">)</span>
	    <span class="p">((</span><span class="nb">= </span><span class="nv">random-init</span> <span class="mi">5</span><span class="p">)</span> <span class="mi">8</span><span class="p">)</span>
	    <span class="p">((</span><span class="nb">= </span><span class="nv">random-init</span> <span class="mi">8</span><span class="p">)</span> <span class="mi">3</span><span class="p">)</span>
	    <span class="p">((</span><span class="nb">= </span><span class="nv">random-init</span> <span class="mi">3</span><span class="p">)</span> <span class="mi">9</span><span class="p">)</span>
	    <span class="p">((</span><span class="nb">= </span><span class="nv">random-init</span> <span class="mi">9</span><span class="p">)</span> <span class="mi">1</span><span class="p">)</span>
	    <span class="p">((</span><span class="nb">= </span><span class="nv">random-init</span> <span class="mi">1</span><span class="p">)</span> <span class="mi">4</span><span class="p">)</span>
	    <span class="p">((</span><span class="nb">= </span><span class="nv">random-init</span> <span class="mi">4</span><span class="p">)</span> <span class="mi">6</span><span class="p">)</span>
	    <span class="p">((</span><span class="nb">= </span><span class="nv">random-init</span> <span class="mi">6</span><span class="p">)</span> <span class="mi">0</span><span class="p">)</span>
	    <span class="p">((</span><span class="nb">= </span><span class="nv">random-init</span> <span class="mi">7</span><span class="p">)</span> <span class="mi">2</span><span class="p">)</span>
	    <span class="p">))</span>

    <span class="p">(</span><span class="k">define </span><span class="p">(</span><span class="nf">generate</span><span class="p">)</span>
      <span class="p">(</span><span class="k">set! </span><span class="nv">random-init</span> <span class="p">(</span><span class="nf">rand-update</span><span class="p">))</span>
      <span class="nv">random-init</span><span class="p">)</span>

    <span class="p">(</span><span class="k">lambda </span><span class="p">(</span><span class="nf">m</span><span class="p">)</span>
      <span class="p">(</span><span class="k">cond </span><span class="p">((</span><span class="nb">eq? </span><span class="nv">m</span> <span class="ss">'reset</span><span class="p">)</span> <span class="p">(</span><span class="k">lambda </span><span class="p">(</span><span class="nf">x</span><span class="p">)</span>
			      <span class="p">(</span><span class="k">begin </span><span class="p">(</span><span class="k">set! </span><span class="nv">random-init</span> <span class="nv">x</span><span class="p">)</span>
				     <span class="nv">x</span><span class="p">)))</span>
	    <span class="p">((</span><span class="nb">eq? </span><span class="nv">m</span> <span class="ss">'generate</span><span class="p">)</span> <span class="p">(</span><span class="nf">generate</span><span class="p">))))</span>
    <span class="p">))</span>

<span class="p">((</span><span class="nf">rand</span> <span class="ss">'reset</span><span class="p">)</span> <span class="mi">8</span><span class="p">)</span>
<span class="p">(</span><span class="nf">rand</span> <span class="ss">'generate</span><span class="p">)</span>
</pre></div>
</div>
</div>


<div id="outline-container-orgd2ec0ce" class="outline-2">
<h2 id="orgd2ec0ce">Упражнение 3.7</h2>
<div class="outline-text-2" id="text-orgd2ec0ce">
<p>
Нужно написать процедуру связанного аккаунта, что бы как новый так и старый пользователи могли с ним работать.
</p>

<div class="highlight"><pre><span></span><span class="p">(</span><span class="k">define </span><span class="nv">peter-acc</span> <span class="p">(</span><span class="nf">make-account</span> <span class="mi">100</span> <span class="ss">'secret</span><span class="p">))</span>
<span class="nv">peter-acc</span>
<span class="p">((</span><span class="nf">peter-acc</span> <span class="ss">'secret</span> <span class="ss">'withdraw</span><span class="p">)</span> <span class="mi">10</span><span class="p">)</span>
<span class="p">((</span><span class="nf">peter-acc</span> <span class="ss">'some-other-password</span> <span class="ss">'deposit</span><span class="p">)</span> <span class="mi">50</span><span class="p">)</span>
<span class="p">((</span><span class="nf">peter-acc</span> <span class="ss">'secret</span> <span class="ss">'deposit</span><span class="p">)</span> <span class="mi">50</span><span class="p">)</span>


<span class="p">(</span><span class="k">define </span><span class="p">(</span><span class="nf">make-joint</span> <span class="nv">account</span> <span class="nv">acc-pass</span> <span class="nv">new-pass</span><span class="p">)</span>
  <span class="p">(</span><span class="nb">display </span><span class="p">((</span><span class="nf">account</span> <span class="nv">acc-pass</span> <span class="ss">'withdraw</span><span class="p">)</span> <span class="mi">0</span><span class="p">))</span>
  <span class="p">(</span><span class="nf">when</span> <span class="p">(</span><span class="nb">equal? </span><span class="p">((</span><span class="nf">account</span> <span class="nv">acc-pass</span> <span class="ss">'withdraw</span><span class="p">)</span> <span class="mi">0</span><span class="p">)</span> <span class="s">"Incorrect password"</span><span class="p">)</span>
    <span class="p">(</span><span class="nf">error</span> <span class="s">"Incorrect password"</span><span class="p">))</span>

  <span class="p">(</span><span class="k">define </span><span class="p">(</span><span class="nf">permission-denied</span> <span class="o">.</span> <span class="nv">m</span><span class="p">)</span>
    <span class="s">"Incorrect password"</span><span class="p">)</span>
  <span class="p">(</span><span class="k">define </span><span class="nv">monitor-error-password</span> <span class="p">(</span><span class="nf">make-monitor</span> <span class="nv">permission-denied</span><span class="p">))</span>
  <span class="p">(</span><span class="k">define </span><span class="p">(</span><span class="nf">call-limit?</span><span class="p">)</span>
    <span class="p">(</span><span class="nf">when</span> <span class="p">(</span><span class="nb">= </span><span class="p">(</span><span class="nf">monitor-error-password</span> <span class="ss">'how-many-call?</span><span class="p">)</span> <span class="mi">7</span><span class="p">)</span>
	<span class="p">(</span><span class="nb">display </span><span class="s">"Viu viu viu viu.."</span><span class="p">)))</span>

  <span class="p">(</span><span class="k">define </span><span class="p">(</span><span class="nf">withdraw</span> <span class="nv">amount</span><span class="p">)</span>
    <span class="p">((</span><span class="nf">account</span> <span class="nv">acc-pass</span> <span class="ss">'withdraw</span><span class="p">)</span> <span class="nv">amount</span><span class="p">))</span>

  <span class="p">(</span><span class="k">define </span><span class="p">(</span><span class="nf">deposit</span> <span class="nv">amount</span><span class="p">)</span>
    <span class="p">((</span><span class="nf">account</span> <span class="nv">acc-pass</span> <span class="ss">'deposit</span><span class="p">)</span> <span class="nv">amount</span><span class="p">))</span>

  <span class="p">(</span><span class="k">define </span><span class="p">(</span><span class="nf">dispatch</span> <span class="nv">pass</span> <span class="nv">func</span><span class="p">)</span>
    <span class="p">(</span><span class="k">cond </span><span class="p">((</span><span class="nb">not </span><span class="p">(</span><span class="nb">eq? </span><span class="nv">pass</span> <span class="nv">new-pass</span><span class="p">))</span> <span class="p">(</span><span class="nf">begin</span>
				       <span class="p">(</span><span class="nf">call-limit?</span><span class="p">)</span>
				       <span class="nv">monitor-error-password</span><span class="p">))</span>
	  <span class="p">((</span><span class="nb">eq? </span><span class="nv">func</span> <span class="ss">'withdraw</span><span class="p">)</span> <span class="nv">withdraw</span><span class="p">)</span>
	  <span class="p">((</span><span class="nb">eq? </span><span class="nv">func</span> <span class="ss">'deposit</span><span class="p">)</span> <span class="nv">deposit</span><span class="p">)</span>
	  <span class="p">(</span><span class="k">else </span><span class="p">(</span><span class="nf">error</span> <span class="s">"Unknown request -- MAKE-ACCOUNT"</span>
		       <span class="nv">func</span><span class="p">))))</span>
  <span class="nv">dispatch</span>
  <span class="p">)</span>


<span class="p">(</span><span class="k">define </span><span class="nv">paul-acc</span>
  <span class="p">(</span><span class="nf">make-joint</span> <span class="nv">peter-acc</span> <span class="ss">'secret</span> <span class="ss">'open-sesam</span><span class="p">))</span>
<span class="p">((</span><span class="nf">paul-acc</span> <span class="ss">'open-sesam</span> <span class="ss">'withdraw</span><span class="p">)</span> <span class="mi">10</span><span class="p">)</span>
</pre></div>
</div>
</div>
